app/Controllers/ForgotPasswordController.php

SELECT *
FROM `employees`
WHERE `email` = 'reejuballabh269@gmail.com'
 LIMIT 1
---
    public function sendResetLink()
    {
        $validation = \Config\Services::validation(); // Load CodeIgniter's validation library
        $email = $this->request->getVar('email');

        // Validate the email
        $validation->setRules([
            'email' => 'required|valid_email',
        ]);

        if (!$validation->run(['email' => $email])) {
            // Email validation failed
            return redirect()->to('/forgot-password')->with('error', 'Invalid email address');
        }

        $EmployeeModel = new EmployeeModel(); // Replace with your user model
        $user = $EmployeeModel->where('email', $email)->first();

INSERT INTO `password_resets` (`email`, `token`, `created_at`) VALUES ('reejuballabh269@gmail.com', 'd62f5893826bf65aba530819ff5ab76c', '2023-09-21 07:09:24')
---
        ];

        // Insert the token into the 'password_resets' table
        db_connect()->table('password_resets')->insert($resetData);